{"term":"Self Paced Labs","definition":"Google Cloud Skills Boost Self Paced Labs. Google owned, hands on labs, highly scalable. Subscription based.","abbreviations":"SPL"}
{"term":"Instructor Led Training","definition":"Classroom based instructor training, utilizing Google Cloud Skills Boost.","abbreviations":"ILT"}
{"term":"On Demand","definition":"Online courses on Coursera, Pluralsight and Google Cloud Skills Boost. Partnership with global scale and fair price.","abbreviations":"OD, OLT"}
{"term":"Events and onboards","definition":"Marketing-led onboard events. Use Google Cloud Skills Boost to onboard users.","abbreviations":null}
{"term":"Advanced Solutions Lab","definition":"Immersive, exclusive experience. Bespoke to the customer. Low volume, personalized. Machine learning etc.","abbreviations":"ASL"}
{"term":"Certifications & other Credentials","definition":"Recognition of competency.","abbreviations":null}
{"term":"User","definition":"Anyone who logs into a learning system","abbreviations":null}
{"term":"Learner","definition":"A “learner” is a metric that is used to quantify learning progress across various learning platforms. It is a measure of learning that likely results in the ability to complete meaningful tasks in Google Cloud, which drives GCP adoption: 4+ hours of training that results in ability to complete meaningful tasks in GCP. Since we are training for Google Cloud adoption, we consider training a higher bar than watching a learning asset or logging in and starting an on-demand course.","abbreviations":null}
{"term":"Trained Individual","definition":"A trained individual is a user who has completed all the training requirements on a learning platform. Individuals are deduplicated within and across platforms (i.e we count them once, no matter how much training they took). We go as far back as January 1st 2018 to identify a user’s learning activity. To identify individuals we are using email addresses - in this sense, individuals = emails. For example, Juan uses his corporate email to complete a set of courses, and uses his personal email to complete other courses, \"Juan\" will be counted as two individuals (once per email used to do the courses).","abbreviations":null}
{"term":"Credentialed Learner","definition":"A credential is an umbrella term that includes certifications, and badges awarded by Google Cloud. Upon successful completion of the credential requirements, a learner is awarded a digital badge by Google Cloud to signify that the learner has completed training and has demonstrated knowledge, skills, or ability. The following are the types of credentials that count towards a credentialed learner: Skill Badge. Note that GenAI ‘Skill Badge’ is not composed of quests with labs and hence does not contribute to Skill Badges official count as of H1 2023. Google Cloud Certifications Note: Digital\/Completion badges DO NOT count towards credentialed learners","abbreviations":null}
{"term":"Certifications","definition":"Certifications are awarded by third-party non-governmental certification bodies, such as an industry or occupational association, based on an individual demonstrating through an examination process that she or he has demonstrated the minimal required knowledge, skills, and abilities to perform a specific job role. There are currently four types of certifications: Fellow, Professional, Associate, and Fundamental. Professional certifications require 3+  years of industry experience, and associate certifications require 6 months + of hands-on experience. Our unique Fellow certification program requires deep experience with hybrid multi-cloud technologies, and also demonstrates the ability to influence stakeholders and decision makers.","abbreviations":null}
{"term":"ILT classroom learners","definition":"ILT classroom learners are counted based on unique ILT rules rather than the “4 Self-Paced Labs” rule used for non-ILT Google Cloud Skills Boost. It is derived from classroom attendees with some additional logic and filtering on top:","abbreviations":null}
{"term":"Learning Activated","definition":"An account (GCP customer only) is learning activated once there are 30+ trained individuals:","abbreviations":null}
