{"dataset_name":"service_customerexperience_learning","table_name":"learner_events","description":"The `learner_events` table is decribed by: All time learning activities table. Each row represents a learning activity started, with flags indicating if that activity resulted in a learner or a trained individual.","example_queries":["Compute the number of learners per month","How many learners did we have per region this year?","Which platform gave us the most learners in the month of June?"]}
{"dataset_name":"service_customerexperience_learning","table_name":"certifications","description":"The `certifications` table is decribed by: A table containing Google Cloud certifications that are achieved by users. Each row represents a certification obtained, including historical\/expired records. The table includes both GSuite and GCP certifications, although we only track GCP certifications for CLS OKRs.","example_queries":["How many certifications were earned in the month of July?","Which certification was the most popular in 2023?","List the number of people who earned each certification in June from the APAC region"]}
{"dataset_name":"service_customerexperience_learning","table_name":"quests","description":"The `quests` table is decribed by: A table containing all quests, including skill badges that are tracked for CLS OKRs. Each row represents a quest enrollment.","example_queries":["Compute the number of skill badges earned this month","Compute the number of skill badges per regions last month","Which quest was the most popular duing August?"]}
{"dataset_name":"service_customerexperience_learning","table_name":"feedback","description":"The `feedback` table is decribed by: A table of containing consolidated feedback for both Survey and CSAT data from all the different channels (Qualtrics & Qwiklabs).","example_queries":["Compute the average overall CSAT score for all classes this year","Which of our classes have an average labs CSAT under 4.4 for the second half of 2023","What is the average CSAT for classes taught in Spanish?"]}
{"dataset_name":"service_customerexperience_learning","table_name":"games","description":"The `games` table is decribed by: A table containing aggregated games activities at user, game and lab level from Qwiklabs.","example_queries":["Which games were part of a Cloud Hero event?\nacross all games last year?","Which games were the most populate in February?","Compute the number of times each game was run this year"]}
{"dataset_name":"service_customerexperience_learning","table_name":"lab_events","description":"The `lab_events` table is decribed by: This table provides insights into lab activities and the context through which the lab was taken.","example_queries":["What is the Average Lab Rating for all labs?","Compute the average rating and success rate for each labs and order by the ratio of the two.","Which lab was the most popular in July 2022"]}
{"dataset_name":"service_customerexperience_learning","table_name":"content_catalog_current","description":"The `content_catalog_current` table is decribed by: A table containing of all the content (quest, course, lab, onboards) sourced from various systems. It captures the latest version of every piece of content at a granularity of name, modality, platform, language.","example_queries":["Which courses are currently available in Spanish?","How many learners did we have per piece of content?","Return the CSAT and Feedback Comments by Course"]}
{"dataset_name":"service_customerexperience_learning_bookings","table_name":"learning_bookings","description":"The `learning_bookings` table is decribed by: This table contains learning deals (Stage 4 Opportunities with Learning SKUs). The level of granularity is quote_line_id and milestone_id.","example_queries":["Compute the Number of opportunities by year with Learning SKU","Total cost at sale price of all Learning SKU, including sale by SKU","Which learning SKU returned the most revenue in 2022?"]}
